In [1]:
# Importing pandas
import pandas as pd

In [2]:
# Creating lists to be part of the dataframe
nome = ['Filipe','Nath','Natan']
idade = [26,25,20]
altura = [1.83,1.55,1.76]

# Creating the dataframe
df = pd.DataFrame({'nome':nome,'idade':idade,'altura':altura})
df

     nome  idade  altura
0  Filipe     26    1.83
1    Nath     25    1.55
2   Natan     20    1.76

In [3]:
# Applying a lambda function to a determined column and storing it in a new column

# A lambda function is applied to the "age" column
# This function takes the value from the age column and multiplies it by 12
# The resulting value is stored in the "age_months" column

df['idade_meses'] = df['idade'].apply(lambda idade: idade * 12)
df

     nome  idade  altura  idade_meses
0  Filipe     26    1.83          312
1    Nath     25    1.55          300
2   Natan     20    1.76          240

In [4]:
# In this case there is no need for a lambda function
df['idade_altura'] = df['idade'] * df['altura']
df

     nome  idade  altura  idade_meses  idade_altura
0  Filipe     26    1.83          312         47.58
1    Nath     25    1.55          300         38.75
2   Natan     20    1.76          240         35.20

In [5]:
# Defining a python funcion
def desconto(preco):
  return preco * 0.9

In [6]:
# Appling a python function with a lambda function in a dataframe
df['descontado'] = df['idade_meses'].apply(lambda idade_meses: desconto(idade_meses))
df

     nome  idade  altura  idade_meses  idade_altura  descontado
0  Filipe     26    1.83          312         47.58       280.8
1    Nath     25    1.55          300         38.75       270.0
2   Natan     20    1.76          240         35.20       216.0

In [7]:
# Sample DataFrame
df = pd.DataFrame({'column1': [1, 2, 3],
                   'column2': [4, 5, 6]})
print(df)

# Applying a lambda function along columns (axis=1)
result_axis_1 = df.apply(lambda row: row['column1'] + row['column2'], axis=1)
print("Result with axis=1:")
print(result_axis_1)

# Applying a lambda function along rows (axis=0)
result_axis_0 = df['column2'].apply(lambda column2: column2 + 5)
print("\nResult with axis=0:")
print(result_axis_0)

   column1  column2
0        1        4
1        2        5
2        3        6
Result with axis=1:
0    5
1    7
2    9
dtype: int64

Result with axis=0:
0     9
1    10
2    11
Name: column2, dtype: int64

In [8]:
# Sample DataFrame
df = pd.DataFrame({'column1': [1, 2, 3],
                   'column2': [4, 5, 6],
                   'column3': [7, 8, 9]})
print(df)

# For each row, multiplying column1 and column3, creating another column with the result
df['axis_1_1'] = df.apply(lambda row: row['column1'] * row['column3'], axis=1)
print("Result with axis=1:")
print(df)

# Geting the same result as above without lambda
df['axis_1_2'] = df['column1'] * df['column3']
print(df)

# For each row, sum 20 to the value of column1, creating another column with the result
df['axis_1_3'] = df.apply(lambda row: row['column1'] + 20, axis=1)
print(df)

# Geting the same result as above without lambda
df['axis_1_4'] = df['column1'] + 20
print(df)

# For each column, apply the sum function to all the column values. The result is a Series stored in a variable
result_axis_0 = df.apply(lambda column: column.sum(), axis=0)
# Include the result Series as a new row to the dataframe
df = pd.concat([df, pd.DataFrame(result_axis_0).T], ignore_index=True)
print(df)

# For each column, sum the values of first and third columns. The result is a Series stored in a variable
result_axis_0_ = df.apply(lambda column: column[0]+ column[2], axis=0)
# Include the result Series as a new row to the dataframe
df = pd.concat([df, pd.DataFrame(result_axis_0_).T], ignore_index=True)
print(df)

   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9
Result with axis=1:
   column1  column2  column3  axis_1_1
0        1        4        7         7
1        2        5        8        16
2        3        6        9        27
   column1  column2  column3  axis_1_1  axis_1_2
0        1        4        7         7         7
1        2        5        8        16        16
2        3        6        9        27        27
   column1  column2  column3  axis_1_1  axis_1_2  axis_1_3
0        1        4        7         7         7        21
1        2        5        8        16        16        22
2        3        6        9        27        27        23
   column1  column2  column3  axis_1_1  axis_1_2  axis_1_3  axis_1_4
0        1        4        7         7         7        21        21
1        2        5        8        16        16        22        22
2        3        6        9        27        27        23        23
   column1  column2  column3  axis_1_1  axis_1_2  axis_1_3  axis_1_4
0        1        4        7         7         7        21        21
1        2        5        8        16        16        22        22
2        3        6        9        27        27        23        23
3        6       15       24        50        50        66        66
   column1  column2  column3  axis_1_1  axis_1_2  axis_1_3  axis_1_4
0        1        4        7         7         7        21        21
1        2        5        8        16        16        22        22
2        3        6        9        27        27        23        23
3        6       15       24        50        50        66        66
4        4       10       16        34        34        44        44

In [9]:
# Undestantion the format of the valiable "result_axis_0_"
column = pd.DataFrame(result_axis_0_)
column

           0
column1    4
column2   10
column3   16
axis_1_1  34
axis_1_2  34
axis_1_3  44
axis_1_4  44

In [10]:
# Transforming the format of the valiable "result_axis_0_"
row = pd.DataFrame(result_axis_0_).T
row

   column1  column2  column3  axis_1_1  axis_1_2  axis_1_3  axis_1_4
0        4       10       16        34        34        44        44